Repository: ericgarzagzz/savvy_cart
Catalog: lib/l10n/app_*.arb
Languages: es, pt, ru

# tapPlusButtonToAddFirstItem
source: Tap the + button below to add your first item
es: Presiona el botón + de abajo para agregar tu primer artículo
pt: Toque no botão + abaixo para adicionar seu primeiro item
ru: Нажмите кнопку + ниже, чтобы добавить первый товар

source: Need more items?
es: ¿Necesitas más artículos?
pt: Precisa de mais itens?
ru: Нужны ещё товары?

# tapButtonBelowToAddMoreItems
source: Tap the button below to add more items
es: Presiona el botón de abajo para agregar más artículos
pt: Toque no botão abaixo para adicionar mais itens
ru: Нажмите кнопку ниже, чтобы добавить больше товаров

source: Add items you still need to buy
es: Agrega artículos que aún necesitas comprar
pt: Adicione itens que você ainda precisa comprar
ru: Добавьте товары, которые вам ещё нужно купить

# tapButtonBelowToAddFirstItem
source: Tap the button below to add your first item
es: Presiona el botón de abajo para agregar tu primer artículo
pt: Toque no botão abaixo para adicionar seu primeiro item
ru: Нажмите кнопку ниже, чтобы добавить первый товар

# addFirstItemToGetStarted
source: Add your first item to get started
es: Agrega tu primer artículo para comenzar
pt: Adicione seu primeiro item para começar
ru: Добавьте первый товар, чтобы начать

source: Generate
es: Generar
pt: Gerar
ru: Создать

source: AI
es: IA
pt: IA
ru: ИИ

source: Filter Models
es: Filtrar Modelos
pt: Filtrar Modelos
ru: Фильтр моделей

source: Thinking Capabilities
es: Capacidades de Pensamiento
pt: Capacidades de Raciocínio
ru: Возможности мышления

source: Input Tokens (in millions)
es: Tokens de Entrada (en millones)
pt: Tokens de Entrada (em milhões)
ru: Входные токены (в миллионах)

source: Min Value
es: Valor Mínimo
pt: Valor Mínimo
ru: Мин. значение

source: Max Value
es: Valor Máximo
pt: Valor Máximo
ru: Макс. значение

source: Output Tokens (in millions)
es: Tokens de Salida (en millones)
pt: Tokens de Saída (em milhões)
ru: Выходные токены (в миллионах)

source: Temperature Range
es: Rango de Temperatura
pt: Faixa de Temperatura
ru: Диапазон температуры

source: Retry
es: Reintentar
pt: Tentar Novamente
ru: Повторить

source: Actions Applied
es: Acciones Aplicadas
pt: Ações Aplicadas
ru: Действия применены

source: Apply Actions
es: Aplicar Acciones
pt: Aplicar Ações
ru: Применить действия

source: Something went wrong
es: Algo salió mal
pt: Algo deu errado
ru: Что-то пошло не так

# pleaseGoBackToHomeScreen
source: Please go back to the home screen
es: Por favor regresa a la pantalla de inicio
pt: Por favor, volte para a tela inicial
ru: Пожалуйста, вернитесь на главный экран

source: Price trend for last purchases
es: Tendencia de precio para las últimas compras
pt: Tendência de preço para as últimas compras
ru: Динамика цен для последних покупок

source: Settings will not be included
es: La configuración no será incluida
pt: As configurações não serão incluídas
ru: Настройки не будут включены

source: Snapshot created successfully
es: Instantánea creada exitosamente
pt: Snapshot criado com sucesso
ru: Снимок успешно создан

source: Create
es: Crear
pt: Criar
ru: Создать

source: Snapshot Created
es: Instantánea Creada
pt: Snapshot Criado
ru: Снимок создан

# snapshotFailed
source: Snapshot failed: {error}
es: Error en la instantánea: {error}
pt: Falha no snapshot: {error}
ru: Создание снимка не удалось: {error}

source: Restore
es: Restaurar
pt: Restaurar
ru: Восстановить

source: Manual Snapshots
es: Instantáneas Manuales
pt: Snapshots Manuais
ru: Ручные снимки

source: Restore Backup
es: Restaurar Respaldo
pt: Restaurar Backup
ru: Восстановить резервную копию

source: Replace existing data
es: Reemplazar datos existentes
pt: Substituir dados existentes
ru: Заменить существующие данные

# clearCurrentDataBeforeRestoring
source: Clear all current data before restoring
es: Limpiar todos los datos actuales antes de restaurar
pt: Limpar todos os dados atuais antes de restaurar
ru: Очистить все текущие данные перед восстановлением

# restoreFailed
source: Restore failed: {error}
es: Error en la restauración: {error}
pt: Falha na restauração: {error}
ru: Восстановление не удалось: {error}

source: Choose what to include
es: Elige qué incluir
pt: Escolha o que incluir
ru: Выберите, что включить

source: Full Export
es: Exportación Completa
pt: Exportação Completa
ru: Полный экспорт

source: Database Only
es: Solo Base de Datos
pt: Apenas Banco de Dados
ru: Только база данных

source: Create Snapshot
es: Crear Instantánea
pt: Criar Snapshot
ru: Создать снимок

source: Done
es: Hecho
pt: Concluído
ru: Готово

source: Clear all current data before importing
es: Limpiar todos los datos actuales antes de importar
pt: Limpar todos os dados atuais antes de importar
ru: Очистить все текущие данные перед импортом

source: Restore Successful
es: Restauración Exitosa
pt: Restauração Bem-sucedida
ru: Восстановление успешно

# filtersWithCount
source: Filters ({count})
es: Filtros ({count})
pt: Filtros ({count})
ru: Фильтры ({count})

source: Filter
es: Filtrar
pt: Filtrar
ru: Фильтр

source: Clear All Filters
es: Limpiar Todos los Filtros
pt: Limpar Todos os Filtros
ru: Очистить все фильтры

# errorWithDetails
source: Error: {details}
pt: Erro: {details}
ru: Ошибка: {details}

source: Created
es: Creado
pt: Criado
ru: Создано

source: Size
es: Tamaño
pt: Tamanho
ru: Размер

source: Important
es: Importante
pt: Importante
ru: Важно

# dataReplacementWarning
source: This will permanently delete all current data and replace it with the backup data.
es: Esto eliminará permanentemente todos los datos actuales y los reemplazará con los datos del respaldo.
pt: Isso excluirá permanentemente todos os dados atuais e os substituirá pelos dados do backup.
ru: Это безвозвратно удалит все текущие данные и заменит их данными из резервной копии.

# dataMergeWarning
source: This will merge the backup data with your current data. Duplicates may occur.
es: Esto combinará los datos del respaldo con tus datos actuales. Pueden ocurrir duplicados.
pt: Isso combinará os dados do backup com seus dados atuais. Podem ocorrer duplicatas.
ru: Это объединит данные из резервной копии с вашими текущими данными. Могут появиться дублирующиеся записи.

source: Data restored successfully
es: Datos restaurados exitosamente
pt: Dados restaurados com sucesso
ru: Данные успешно восстановлены

source: Backup data merged successfully
es: Datos del respaldo combinados exitosamente
pt: Dados do backup combinados com sucesso
ru: Данные из резервной копии успешно объединены

source: Quick Options
es: Opciones Rápidas
pt: Opções Rápidas
ru: Быстрые параметры

source: Shopping Lists
es: Listas de Compras
pt: Listas de Compras
ru: Списки покупок

source: Backup Information
es: Información del Respaldo
pt: Informações do Backup
ru: Информация о резервной копии

source: File
es: Archivo
pt: Arquivo
ru: Файл

source: Includes Settings
es: Incluye Configuración
pt: Inclui Configurações
ru: Включает настройки

source: Import Options
es: Opciones de Importación
pt: Opções de Importação
ru: Параметры импорта

# dataRestoredSuccessfullyMessage
source: Your data has been restored successfully.
es: Tus datos han sido restaurados exitosamente.
pt: Seus dados foram restaurados com sucesso.
ru: Ваши данные были успешно восстановлены.

# backupDataMergedSuccessfullyMessage
source: The backup data has been merged with your current data successfully.
es: Los datos del respaldo han sido combinados con tus datos actuales exitosamente.
pt: Os dados do backup foram combinados com seus dados atuais com sucesso.
ru: Данные из резервной копии были успешно объединены с вашими текущими данными.

source: AI Assistant Configuration
es: Configuración del Asistente de IA
pt: Configuração do Assistente de IA
ru: Настройка ИИ-помощника

# configureAiAssistantDescription
source: Configure your AI assistant to help manage shopping lists and provide suggestions.
es: Configura tu asistente de IA para ayudar a administrar listas de compras y proporcionar sugerencias.
pt: Configure seu assistente de IA para ajudar a gerenciar listas de compras e fornecer sugestões.
ru: Настройте вашего ИИ-помощника для управления списками покупок и получения предложений.

source: API Configuration
es: Configuración de API
pt: Configuração da API
ru: Настройка API

# setupGeminiApiKeyDescription
source: Set up your Google™ Gemini™ API key to enable AI features
es: Configura tu clave API de Google™ Gemini™ para habilitar funciones de IA
pt: Configure sua chave API do Google™ Gemini™ para habilitar recursos de IA
ru: Настройте ваш API-ключ Google™ Gemini™ для включения функций ИИ

source: Connection Status
es: Estado de Conexión
pt: Status da Conexão
ru: Статус соединения

source: About Google™ Gemini™
es: Acerca de Google™ Gemini™
pt: Sobre o Google™ Gemini™
ru: О Google™ Gemini™

# getFreeApiKeyFromGoogleAi
source: Get your free API key from Google™ AI Studio
es: Obtén tu clave API gratuita desde Google™ AI Studio
pt: Obtenha sua chave API gratuita no Google™ AI Studio
ru: Получите бесплатный API-ключ в Google™ AI Studio

# aiFeaturesIncludeChatAndSuggestions
source: AI features include chat assistance and smart suggestions
es: Las funciones de IA incluyen asistencia de chat y sugerencias inteligentes
pt: Os recursos de IA incluem assistência de chat e sugestões inteligentes
ru: Функции ИИ включают помощь в чате и умные предложения

# apiKeyStoredSecurely
source: Your API key is stored securely on your device
es: Tu clave API se almacena de forma segura en tu dispositivo
pt: Sua chave API é armazenada com segurança em seu dispositivo
ru: Ваш API-ключ надёжно хранится на вашем устройстве

# apiUsageSubjectToRateLimits
source: API usage may be subject to Google™'s rate limits
es: El uso de la API puede estar sujeto a los límites de velocidad de Google™
pt: O uso da API pode estar sujeito aos limites de taxa do Google™
ru: Использование API может подлежать ограничениям скорости Google™

# googleTrademarkDisclaimer
source: Google™ and Gemini™ are trademarks of Google LLC. This app is not affiliated with Google.
es: Google™ y Gemini™ son marcas comerciales de Google LLC. Esta aplicación no está afiliada con Google.
pt: Google™ e Gemini™ são marcas registradas da Google LLC. Este aplicativo não é afiliado ao Google.
ru: Google™ и Gemini™ являются торговыми марками Google LLC. Это приложение не связано с Google.

source: Automatic Backup
es: Respaldo Automático
pt: Backup Automático
ru: Автоматическое резервное копирование

# dataAutomaticallyBackedUpToDrive
source: Your data is automatically backed up to Google Drive
es: Tus datos se respaldan automáticamente en Google Drive
pt: Seus dados são automaticamente salvos no Google Drive
ru: Ваши данные автоматически сохраняются в Google Drive

# automaticBackupEnabledAndWorking
source: Automatic backup is enabled and working
es: El respaldo automático está habilitado y funcionando
pt: O backup automático está habilitado e funcionando
ru: Автоматическое резервное копирование включено и работает

source: Automatic backup configuration detected
es: Configuración de respaldo automático detectada
pt: Configuração de backup automático detectada
ru: Обнаружена конфигурация автоматического резервного копирования

# automaticBackupInfoMessage
source: Automatic backup runs periodically in the background. Manual snapshots work locally, but won't survive app uninstalls until automatic backup has synced them to Google Drive.
es: El respaldo automático se ejecuta periódicamente en segundo plano. Las instantáneas manuales funcionan localmente, pero no sobrevivirán a las desinstalaciones de la aplicación hasta que el respaldo automático las haya sincronizado con Google Drive.
pt: O backup automático é executado periodicamente em segundo plano. Os snapshots manuais funcionam localmente, mas não sobreviverão às desinstalações do aplicativo até que o backup automático os tenha sincronizado com o Google Drive.
ru: Автоматическое резервное копирование выполняется периодически в фоновом режиме. Ручные снимки работают локально, но не сохранятся при удалении приложения до тех пор, пока автоматическое резервное копирование не синхронизирует их с Google Drive.

source: How Backup Works
es: Cómo Funciona el Respaldo
pt: Como Funciona o Backup
ru: Как работает резервное копирование

# automaticBackupSyncsToGoogleDrive
source: Automatic backup syncs your data to Google Drive
es: El respaldo automático sincroniza tus datos con Google Drive
pt: O backup automático sincroniza seus dados com o Google Drive
ru: Автоматическое резервное копирование синхронизирует ваши данные с Google Drive

# manualSnapshotsStoredLocallyAndSynced
source: Manual snapshots are stored locally and included in automatic sync
es: Las instantáneas manuales se almacenan localmente e incluyen en la sincronización automática
pt: Os snapshots manuais são armazenados localmente e incluídos na sincronização automática
ru: Ручные снимки хранятся локально и включаются в автоматическую синхронизацию

# restoringWillReplaceCurrentData
source: Restoring will replace your current data
es: Restaurar reemplazará tus datos actuales
pt: Restaurar substituirá seus dados atuais
ru: Восстановление заменит ваши текущие данные

# backupsIncludeShoppingListsChatAndSettings
source: Backups include shopping lists, chat history, and optionally settings
es: Los respaldos incluyen listas de compras, historial de chat y opcionalmente configuración
pt: Os backups incluem listas de compras, histórico de chat e opcionalmente configurações
ru: Резервные копии включают списки покупок, историю чата и, опционально, настройки

source: No manual snapshots yet
es: Aún no hay instantáneas manuales
pt: Ainda não há snapshots manuais
ru: Пока нет ручных снимков

# createManualSnapshotForAdditionalControl
source: Create a manual snapshot to have additional control over your data
es: Crea una instantánea manual para tener control adicional sobre tus datos
pt: Crie um snapshot manual para ter controle adicional sobre seus dados
ru: Создайте ручной снимок для дополнительного контроля над вашими данными

source: Create and manage additional snapshot files
es: Crear y administrar archivos de instantánea adicionales
pt: Criar e gerenciar arquivos de snapshot adicionais
ru: Создание и управление дополнительными файлами снимков

source: Thinking
es: Pensamiento
pt: Raciocínio
ru: Мышление

source: Input
es: Entrada
pt: Entrada
ru: Вход

source: Output
es: Salida
pt: Saída
ru: Выход

source: Temperature
es: Temperatura
pt: Temperatura
ru: Температура

# tokensUnit
source: M tokens
ru: млн токенов

source: Filtered by
es: Filtrado por
pt: Filtrado por
ru: Фильтр по

source: Clear
es: Limpiar
pt: Limpar
ru: Очистить

# confirmDeleteShopList
source: Are you sure you want to delete the shop list "{listName}"?
es: ¿Estás seguro de que quieres eliminar la lista de compras "{listName}"?
pt: Tem certeza de que deseja excluir a lista de compras "{listName}"?
ru: Вы уверены, что хотите удалить список покупок "{listName}"?

source: No Shopping Lists Yet
es: Aún No Hay Listas de Compras
pt: Ainda Não Há Listas de Compras
ru: Пока нет списков покупок

# createFirstShoppingListDescription
source: Create your first shopping list above to start organizing your groceries and never forget an item again!
es: ¡Crea tu primera lista de compras arriba para comenzar a organizar tu mandado y nunca olvidar un artículo otra vez!
pt: Crie sua primeira lista de compras acima para começar a organizar suas compras e nunca mais esquecer um item!
ru: Создайте ваш первый список покупок выше, чтобы начать организовывать ваши продукты и никогда не забыть ни одного товара!

source: Recent Lists
es: Listas Recientes
pt: Listas Recentes
ru: Недавние списки

# itemsShown
source: {count} shown
es: {count} mostrados
pt: {count} mostrados
ru: Показано: {count}

# itemsCompleted
source: {completed} of {total} items completed
es: {completed} de {total} artículos completados
pt: {completed} de {total} itens concluídos
ru: Выполнено {completed} из {total} товаров
