Repository: ericgarzagzz/savvy_cart
Catalog: lib/l10n/app_*.arb
Languages: es, pt, ru

# appSubtitle
source: Smart Shopping Lists
es: Listas de Compras Inteligentes
pt: Listas de Compras Inteligentes
ru: Умные списки покупок

# settingsTitle
source: SavvyCart settings
es: Configuración de SavvyCart
pt: Configurações do SavvyCart
ru: Настройки SavvyCart

# chatWithList
source: Chat with {listName}
es: Chatear con {listName}
pt: Conversar com {listName}
ru: Чат со списком "{listName}"

source: Search Item Price
es: Buscar Precio del Artículo
pt: Buscar Preço do Item
ru: Поиск цены товара

# backupAndRestore
source: Backup & Restore
es: Respaldo y Restauración
pt: Backup e Restauração
ru: Резервное копирование и восстановление

source: Shopping Insights
es: Información de Compras
pt: Insights de Compras
ru: Аналитика покупок

source: Search Lists
es: Buscar Listas
pt: Buscar Listas
ru: Поиск списков

source: Select Gemini™ Model
es: Seleccionar Modelo Gemini™
pt: Selecionar Modelo Gemini™
ru: Выбрать модель Gemini™

source: AI Settings
es: Configuración de IA
pt: Configurações de IA
ru: Настройки ИИ

source: Add Item
es: Agregar Artículo
pt: Adicionar Item
ru: Добавить товар

source: Create Shopping List
es: Crear Lista de Compras
pt: Criar Lista de Compras
ru: Создать список покупок

source: Create New List
es: Crear Nueva Lista
pt: Criar Nova Lista
ru: Создать новый список

source: Load More
es: Cargar Más
pt: Carregar Mais
ru: Загрузить ещё

source: Execute Selected Actions
es: Ejecutar Acciones Seleccionadas
pt: Executar Ações Selecionadas
ru: Выполнить выбранные действия

source: Clear All
es: Limpiar Todo
pt: Limpar Tudo
ru: Очистить всё

source: Apply
es: Aplicar
pt: Aplicar
ru: Применить

source: Cancel
es: Cancelar
pt: Cancelar
ru: Отмена

source: Save
es: Guardar
pt: Salvar
ru: Сохранить

source: Delete
es: Eliminar
pt: Excluir
ru: Удалить

source: Confirm
es: Confirmar
pt: Confirmar
ru: Подтвердить

source: Close
es: Cerrar
pt: Fechar
ru: Закрыть

source: Go Home
es: Ir al Inicio
pt: Ir ao Início
ru: На главную

source: Go to Home Page
es: Ir a la Página de Inicio
pt: Ir para a Página Inicial
ru: Перейти на главную страницу

source: Enter list name
es: Ingresa el nombre de la lista
pt: Digite o nome da lista
ru: Введите название списка

source: List Name
es: Nombre de la Lista
pt: Nome da Lista
ru: Название списка

source: Item Name
es: Nombre del Artículo
pt: Nome do Item
ru: Название товара

source: Enter item name...
es: Ingresa el nombre del artículo...
pt: Digite o nome do item...
ru: Введите название товара...

source: Search by list name...
es: Buscar por nombre de lista...
pt: Buscar por nome da lista...
ru: Поиск по названию списка...

source: Type your message...
es: Escribe tu mensaje...
pt: Digite sua mensagem...
ru: Введите ваше сообщение...

# geminiApiKey
source: Google™ Gemini™ API Key
es: Clave API de Google™ Gemini™
pt: Chave API do Google™ Gemini™
ru: API-ключ Google™ Gemini™

source: Gemini™ Model
es: Modelo Gemini™
pt: Modelo Gemini™
ru: Модель Gemini™

# listNameCannotBeEmpty
source: The list's name cannot be empty
es: El nombre de la lista no puede estar vacío
pt: O nome da lista não pode estar vazio
ru: Название списка не может быть пустым

source: AI Assistant
es: Asistente de IA
pt: Assistente de IA
ru: ИИ-помощник

source: Data
es: Datos
pt: Dados
ru: Данные

source: Developer
es: Desarrollador
pt: Desenvolvedor
ru: Разработчик

source: Generate Mock Data
es: Generar Datos de Prueba
pt: Gerar Dados de Teste
ru: Создать тестовые данные

source: Delete Database
es: Eliminar Base de Datos
pt: Excluir Banco de Dados
ru: Удалить базу данных

source: About
es: Acerca de
pt: Sobre
ru: О приложении

source: Version
es: Versión
pt: Versão
ru: Версия

source: Ready
es: Listo
pt: Pronto
ru: Готов

source: Not verified
es: No verificado
pt: Não verificado
ru: Не проверен

source: Not configured
es: No configurado
pt: Não configurado
ru: Не настроен

source: Manage backups
es: Administrar respaldos
pt: Gerenciar backups
ru: Управление резервными копиями

source: Add sample shopping lists
es: Agregar listas de compras de ejemplo
pt: Adicionar listas de compras de exemplo
ru: Добавить примеры списков покупок

source: Clear all data
es: Limpiar todos los datos
pt: Limpar todos os dados
ru: Очистить все данные

source: Loading...
es: Cargando...
pt: Carregando...
ru: Загрузка...

source: Recommended
es: Recomendado
pt: Recomendado
ru: Рекомендуется

source: Delete shop list
es: Eliminar lista de compras
pt: Excluir lista de compras
ru: Удалить список покупок

source: Edit Item Name
es: Editar Nombre del Artículo
pt: Editar Nome do Item
ru: Изменить название товара

source: Delete Item
es: Eliminar Artículo
pt: Excluir Item
ru: Удалить товар

source: Delete Backup
es: Eliminar Respaldo
pt: Excluir Backup
ru: Удалить резервную копию

source: Create Manual Snapshot
es: Crear Instantánea Manual
pt: Criar Snapshot Manual
ru: Создать ручной снимок

source: Error
pt: Erro
ru: Ошибка

source: To Buy
es: Por Comprar
pt: Para Comprar
ru: К покупке

source: In Cart
es: En el Carrito
pt: No Carrinho
ru: В корзине

source: Lists Created
es: Listas Creadas
pt: Listas Criadas
ru: Создано списков

source: Total Spent
es: Total Gastado
pt: Total Gasto
ru: Всего потрачено

source: Filter by Date Range
es: Filtrar por Rango de Fechas
pt: Filtrar por Período
ru: Фильтр по диапазону дат

source: Start Date
es: Fecha de Inicio
pt: Data de Início
ru: Дата начала

source: End Date
es: Fecha Final
pt: Data Final
ru: Дата окончания

source: Token Limits
es: Límites de Tokens
pt: Limites de Tokens
ru: Лимиты токенов

source: All
es: Todos
pt: Todos
ru: Все

source: Yes
es: Sí
pt: Sim
ru: Да

source: No
pt: Não
ru: Нет

source: Search Results ({count})
es: Resultados de Búsqueda ({count})
pt: Resultados da Busca ({count})
ru: Результаты поиска ({count})

source: No Shopping Data Yet
es: Aún No Hay Datos de Compras
pt: Ainda Não Há Dados de Compras
ru: Пока нет данных о покупках

# createFirstListDescription
source: Create your first shopping list to start tracking insights about your shopping patterns and spending habits.
es: Crea tu primera lista de compras para comenzar a rastrear información sobre tus patrones de compra y hábitos de gasto.
pt: Crie sua primeira lista de compras para começar a acompanhar insights sobre seus padrões de compra e hábitos de gastos.
ru: Создайте первый список покупок, чтобы начать отслеживать аналитику ваших покупательских привычек и трат.

source: No items found
es: No se encontraron artículos
pt: Nenhum item encontrado
ru: Товары не найдены

# tryDifferentSearchTerm
source: Try a different search term or add "{searchQuery}" as a new item
es: Intenta con un término de búsqueda diferente o agrega "{searchQuery}" como un nuevo artículo
pt: Tente um termo de busca diferente ou adicione "{searchQuery}" como um novo item
ru: Попробуйте другой поисковый запрос или добавьте "{searchQuery}" как новый товар

source: No price history available
es: No hay historial de precios disponible
pt: Nenhum histórico de preços disponível
ru: История цен недоступна

# purchaseItemToTrackPrice
source: Purchase this item to start tracking its price trends
es: Compra este artículo para comenzar a rastrear sus tendencias de precio
pt: Compre este item para começar a acompanhar suas tendências de preço
ru: Купите этот товар, чтобы начать отслеживать динамику его цены

source: No lists found
es: No se encontraron listas
pt: Nenhuma lista encontrada
ru: Списки не найдены

# tryAdjustingFilters
source: Try adjusting your search terms or date filters
es: Intenta ajustar tus términos de búsqueda o filtros de fecha
pt: Tente ajustar seus termos de busca ou filtros de data
ru: Попробуйте изменить условия поиска или фильтры дат

source: Loading available models...
es: Cargando modelos disponibles...
pt: Carregando modelos disponíveis...
ru: Загрузка доступных моделей...

# failedToRemoveItem
source: Failed to remove item: {error}
es: Error al eliminar artículo: {error}
pt: Falha ao remover item: {error}
ru: Не удалось удалить товар: {error}

# couldNotLoadShopListItems
source: Could not load shop list's items due to an error.
es: No se pudieron cargar los artículos de la lista de compras debido a un error.
pt: Não foi possível carregar os itens da lista de compras devido a um erro.
ru: Не удалось загрузить товары списка покупок из-за ошибки.

source: Error loading search results
es: Error al cargar resultados de búsqueda
pt: Erro ao carregar resultados da busca
ru: Ошибка загрузки результатов поиска

source: Please try again later
es: Por favor intenta de nuevo más tarde
pt: Por favor, tente novamente mais tarde
ru: Пожалуйста, попробуйте снова позже

source: Error loading suggestions
es: Error al cargar sugerencias
pt: Erro ao carregar sugestões
ru: Ошибка загрузки предложений

# failedToLoadBackupInfo
source: Failed to load backup information: {error}
es: Error al cargar información del respaldo: {error}
pt: Falha ao carregar informações do backup: {error}
ru: Не удалось загрузить информацию о резервной копии: {error}

# pageNotFound
source: Page not found: {uri}
es: Página no encontrada: {uri}
pt: Página não encontrada: {uri}
ru: Страница не найдена: {uri}

source: Invalid shop list ID
es: ID de lista de compras inválido
pt: ID da lista de compras inválido
ru: Неверный ID списка покупок

source: Invalid item name
es: Nombre de artículo inválido
pt: Nome do item inválido
ru: Неверное название товара

# badRequest
source: Bad request: {responseBody}
es: Solicitud incorrecta: {responseBody}
pt: Solicitação incorreta: {responseBody}
ru: Неверный запрос: {responseBody}

# invalidApiKeyOrAuth
source: Invalid API key or authentication failed
es: Clave API inválida o falló la autenticación
pt: Chave API inválida ou falha na autenticação
ru: Неверный API-ключ или ошибка аутентификации

# accessForbidden
source: Access forbidden - check API permissions
es: Acceso prohibido - verifica los permisos de la API
pt: Acesso negado - verifique as permissões da API
ru: Доступ запрещён - проверьте разрешения API

# apiRateLimitExceeded
source: API rate limit exceeded. Please try again later.
es: Límite de velocidad de la API excedido. Por favor intenta de nuevo más tarde.
pt: Limite de taxa da API excedido. Por favor, tente novamente mais tarde.
ru: Превышен лимит API. Пожалуйста, попробуйте снова позже.

source: Internal server error
es: Error interno del servidor
pt: Erro interno do servidor
ru: Внутренняя ошибка сервера

# badGateway
source: Bad gateway - service temporarily unavailable
es: Gateway incorrecto - servicio temporalmente no disponible
pt: Gateway incorreto - serviço temporariamente indisponível
ru: Неверный шлюз - сервис временно недоступен

source: Service unavailable
es: Servicio no disponible
pt: Serviço indisponível
ru: Сервис недоступен

source: Gateway timeout
es: Tiempo de espera del gateway agotado
pt: Tempo limite do gateway esgotado
ru: Тайм-аут шлюза

# noInternetConnection
source: No internet connection available
es: No hay conexión a internet disponible
pt: Nenhuma conexão com a internet disponível
ru: Нет подключения к интернету

source: Request timed out
es: Se agotó el tiempo de espera de la solicitud
pt: Tempo limite da solicitação esgotado
ru: Истекло время ожидания запроса

# invalidResponseFormat
source: Invalid response format from API
es: Formato de respuesta inválido de la API
pt: Formato de resposta inválido da API
ru: Неверный формат ответа API

source: Generating mock data...
es: Generando datos de prueba...
pt: Gerando dados de teste...
ru: Создание тестовых данных...

source: Mock data generated successfully!
es: ¡Datos de prueba generados exitosamente!
pt: Dados de teste gerados com sucesso!
ru: Тестовые данные успешно созданы!

# errorGeneratingMockData
source: Error generating mock data: {error}
es: Error al generar datos de prueba: {error}
pt: Erro ao gerar dados de teste: {error}
ru: Ошибка создания тестовых данных: {error}

source: Database deleted successfully
es: Base de datos eliminada exitosamente
pt: Banco de dados excluído com sucesso
ru: База данных успешно удалена

# errorDeletingDatabase
source: Error deleting database: {error}
es: Error al eliminar base de datos: {error}
pt: Erro ao excluir banco de dados: {error}
ru: Ошибка удаления базы данных: {error}

source: Backup deleted successfully
es: Respaldo eliminado exitosamente
pt: Backup excluído com sucesso
ru: Резервная копия успешно удалена

# failedToDeleteBackup
source: Failed to delete backup: {error}
es: Error al eliminar respaldo: {error}
pt: Falha ao excluir backup: {error}
ru: Не удалось удалить резервную копию: {error}

# pleaseEnterValidApiKey
source: Please enter a valid API key first
es: Por favor ingresa una clave API válida primero
pt: Por favor, digite uma chave API válida primeiro
ru: Пожалуйста, сначала введите действительный API-ключ

source: Processing...
es: Procesando...
pt: Processando...
ru: Обработка...

source: Start your shopping journey
es: Comienza tu viaje de compras
pt: Inicie sua jornada de compras
ru: Начните свой путь покупок

# searchForItemViewHistory
source: Search for an item to view its price history
es: Busca un artículo para ver su historial de precios
pt: Busque um item para ver seu histórico de preços
ru: Найдите товар, чтобы просмотреть историю его цен

# orChooseFromPreviousItems
source: Or choose from your previous items:
es: O elige de tus artículos anteriores:
pt: Ou escolha de seus itens anteriores:
ru: Или выберите из ваших предыдущих товаров:

source: Search Results:
es: Resultados de Búsqueda:
pt: Resultados da Busca:
ru: Результаты поиска:

# addItemsToSeeHere
source: Add items to your shopping lists to see them here
es: Agrega artículos a tus listas de compras para verlos aquí
pt: Adicione itens às suas listas de compras para vê-los aqui
ru: Добавьте товары в свои списки покупок, чтобы увидеть их здесь

# tryDifferentSearchOrCreate
source: Try a different search term or create a chart for "{searchQuery}"
es: Intenta con un término de búsqueda diferente o crea un gráfico para "{searchQuery}"
pt: Tente um termo de busca diferente ou crie um gráfico para "{searchQuery}"
ru: Попробуйте другой поисковый запрос или создайте график для "{searchQuery}"

# areYouSureDeleteBackup
source: Are you sure you want to delete this backup?
es: ¿Estás seguro de que quieres eliminar este respaldo?
pt: Tem certeza de que deseja excluir este backup?
ru: Вы уверены, что хотите удалить эту резервную копию?

# mockDataGenerationDescription
source: This will create sample shopping lists with items across the year for analytics testing. This may take a few moments.
es: Esto creará listas de compras de ejemplo con artículos a lo largo del año para pruebas de análisis. Esto puede tomar algunos momentos.
pt: Isso criará listas de compras de exemplo com itens ao longo do ano para testes de análise. Isso pode levar alguns momentos.
ru: Это создаст примеры списков покупок с товарами на протяжении года для тестирования аналитики. Это может занять несколько минут.

# databaseDeletionWarning
source: This will permanently delete all your data including shopping lists, items, and settings. This action cannot be undone.
es: Esto eliminará permanentemente todos tus datos incluyendo listas de compras, artículos y configuraciones. Esta acción no se puede deshacer.
pt: Isso excluirá permanentemente todos os seus dados incluindo listas de compras, itens e configurações. Esta ação não pode ser desfeita.
ru: Это безвозвратно удалит все ваши данные, включая списки покупок, товары и настройки. Это действие нельзя отменить.

source: Shopping Lists (always included)
es: Listas de Compras (siempre incluidas)
pt: Listas de Compras (sempre incluídas)
ru: Списки покупок (всегда включены)

# chooseAdditionalData
source: Choose additional data to include:
es: Elige datos adicionales para incluir:
pt: Escolha dados adicionais para incluir:
ru: Выберите дополнительные данные для включения:

source: Settings
es: Configuración
pt: Configurações
ru: Настройки

source: Chat History
es: Historial de Chat
pt: Histórico de Chat
ru: История чата

source: Suggestions
es: Sugerencias
pt: Sugestões
ru: Предложения

source: Add "{searchQuery}"
es: Agregar "{searchQuery}"
pt: Adicionar "{searchQuery}"
ru: Добавить "{searchQuery}"

# viewChartFor
source: View chart for "{searchQuery}"
es: Ver gráfico para "{searchQuery}"
pt: Ver gráfico para "{searchQuery}"
ru: Посмотреть график для "{searchQuery}"

# chooseAiModelDescription
source: Choose the AI model to use for processing
es: Elige el modelo de IA para usar en el procesamiento
pt: Escolha o modelo de IA para usar no processamento
ru: Выберите модель ИИ для обработки

source: Actions Discarded
es: Acciones Descartadas
pt: Ações Descartadas
ru: Действия отменены

source: Weekly Overview
es: Resumen Semanal
pt: Resumo Semanal
ru: Недельный обзор

source: Error loading insights
es: Error al cargar información
pt: Erro ao carregar insights
ru: Ошибка загрузки аналитики

source: No matching items found
es: No se encontraron artículos coincidentes
pt: Nenhum item correspondente encontrado
ru: Подходящие товары не найдены

source: Remove Item and Suggestion?
es: ¿Eliminar Artículo y Sugerencia?
pt: Remover Item e Sugestão?
ru: Удалить товар и предложение?

source: Remove Suggestion?
es: ¿Eliminar Sugerencia?
pt: Remover Sugestão?
ru: Удалить предложение?

# removeItemAndSuggestionDesc
source: This will remove "{itemName}" from your current shopping list and also from your suggestions.
es: Esto eliminará "{itemName}" de tu lista de compras actual y también de tus sugerencias.
pt: Isso removerá "{itemName}" da sua lista de compras atual e também das suas sugestões.
ru: Это удалит "{itemName}" из вашего текущего списка покупок, а также из ваших предложений.

# removeSuggestionDesc
source: This will remove "{itemName}" from your suggestions. It will not affect your current shopping list.
es: Esto eliminará "{itemName}" de tus sugerencias. No afectará tu lista de compras actual.
pt: Isso removerá "{itemName}" das suas sugestões. Não afetará sua lista de compras atual.
ru: Это удалит "{itemName}" из ваших предложений. Это не повлияет на ваш текущий список покупок.

source: Remove
es: Eliminar
pt: Remover
ru: Удалить

# itemsSelected
source: {count} selected
es: {count} seleccionados
pt: {count} selecionados
ru: Выбрано: {count}

# chatWith
source: Chat with {listName}
es: Chatear con {listName}
pt: Conversar com {listName}
ru: Чат с {listName}

source: Review AI Suggestions
es: Revisar Sugerencias de IA
pt: Revisar Sugestões de IA
ru: Проверить предложения ИИ

# pleaseSelectAtLeastOneAction
source: Please select at least one action to execute
es: Por favor selecciona al menos una acción para ejecutar
pt: Por favor, selecione pelo menos uma ação para executar
ru: Пожалуйста, выберите хотя бы одно действие для выполнения

source: Applied Actions
es: Acciones Aplicadas
pt: Ações Aplicadas
ru: Применённые действия

source: No actions were applied
es: No se aplicaron acciones
pt: Nenhuma ação foi aplicada
ru: Никаких действий не было применено

source: Frequently Bought Items
es: Artículos Comprados Frecuentemente
pt: Itens Comprados Frequentemente
ru: Часто покупаемые товары

source: Search item
es: Buscar artículo
pt: Buscar item
ru: Найти товар

source: No frequently bought items
es: No hay artículos comprados frecuentemente
pt: Nenhum item comprado frequentemente
ru: Нет часто покупаемых товаров

# completeListsToSeeMostBought
source: Complete shopping lists to see your most bought items
es: Completa listas de compras para ver tus artículos más comprados
pt: Complete listas de compras para ver seus itens mais comprados
ru: Завершите списки покупок, чтобы увидеть ваши самые покупаемые товары

# timesPurchased
source: Purchased {count} times
es: Comprado {count} veces
pt: Comprado {count} vezes
ru: Куплено {count} раз

# errorLoadingFrequentlyBought
source: Error loading frequently bought items
es: Error al cargar artículos comprados frecuentemente
pt: Erro ao carregar itens comprados frequentemente
ru: Ошибка загрузки часто покупаемых товаров

source: Error loading data
es: Error al cargar datos
pt: Erro ao carregar dados
ru: Ошибка загрузки данных

# discoverShoppingPatterns
source: Discover your shopping patterns
es: Descubre tus patrones de compra
pt: Descubra seus padrões de compra
ru: Изучите ваши покупательские привычки

source: Error loading price history
es: Error al cargar historial de precios
pt: Erro ao carregar histórico de preços
ru: Ошибка загрузки истории цен

source: Only one purchase found
es: Solo se encontró una compra
pt: Apenas uma compra encontrada
ru: Найдена только одна покупка

# lastPurchasedFor
source: Last purchased for {price}
es: Última compra por {price}
pt: Última compra por {price}
ru: Последняя покупка за {price}

# purchasedOn
source: Purchased on {date}
es: Comprado el {date}
pt: Comprado em {date}
ru: Куплено {date}

# purchaseMoreTimesToSeeTrends
source: Purchase this item more times to see price trends
es: Compra este artículo más veces para ver tendencias de precio
pt: Compre este item mais vezes para ver tendências de preço
ru: Купите этот товар ещё несколько раз, чтобы увидеть динамику цен

source: Average
es: Promedio
pt: Média
ru: Средняя

source: Lowest
es: Más Bajo
pt: Mais Baixo
ru: Минимальная

source: Highest
es: Más Alto
pt: Mais Alto
ru: Максимальная

source: Search or add new item...
es: Buscar o agregar nuevo artículo...
pt: Buscar ou adicionar novo item...
ru: Найти или добавить новый товар...

source: Frequently Bought
es: Comprados Frecuentemente
pt: Comprados Frequentemente
ru: Часто покупаемые

# errorLoadingResults
source: Error loading results: {error}
es: Error al cargar resultados: {error}
pt: Erro ao carregar resultados: {error}
ru: Ошибка загрузки результатов: {error}

# searchResultsZero
source: Search Results (0)
es: Resultados de Búsqueda (0)
pt: Resultados da Busca (0)
ru: Результаты поиска (0)

# tryDifferentSearchOrAdd
source: Try a different search term or add "{searchQuery}" as a new item
es: Intenta con un término de búsqueda diferente o agrega "{searchQuery}" como un nuevo artículo
pt: Tente um termo de busca diferente ou adicione "{searchQuery}" como um novo item
ru: Попробуйте другой поисковый запрос или добавьте "{searchQuery}" как новый товар

source: Error loading item
es: Error al cargar artículo
pt: Erro ao carregar item
ru: Ошибка загрузки товара

source: Item not found
es: Artículo no encontrado
pt: Item não encontrado
ru: Товар не найден

# confirmDeleteItem
source: Are you sure you want to delete "{itemName}"?
es: ¿Estás seguro de que quieres eliminar "{itemName}"?
pt: Tem certeza de que deseja excluir "{itemName}"?
ru: Вы уверены, что хотите удалить "{itemName}"?

source: Quantity
es: Cantidad
pt: Quantidade
ru: Количество

source: Required
es: Requerido
pt: Obrigatório
ru: Обязательно

source: Invalid number
es: Número inválido
pt: Número inválido
ru: Неверное число

source: Price
es: Precio
pt: Preço
ru: Цена

source: Total
ru: Итого

# errorLoadingShopListItems
source: Could not load shop list's items due to an error.
es: No se pudieron cargar los artículos de la lista de compras debido a un error.
pt: Não foi possível carregar os itens da lista de compras devido a um erro.
ru: Не удалось загрузить товары списка покупок из-за ошибки.

source: No items in cart yet
es: Aún no hay artículos en el carrito
pt: Ainda não há itens no carrinho
ru: В корзине пока нет товаров

source: Ready to start shopping?
es: ¿Listo para comenzar a comprar?
pt: Pronto para começar a comprar?
ru: Готовы начать покупки?

source: Items you check off will appear here
es: Los artículos que marques aparecerán aquí
pt: Os itens que você marcar aparecerão aqui
ru: Товары, которые вы отметите, появятся здесь
